create table movies(
	id serial primary key,
 	title      text,
 	description text,
	release_year int,
	director    text,
	rating      int default 0,
 	is_watched   bool default 0,
	trailer_url  text,
);


insert into movies(title, description, release_year, director, rating, is_watched, trailer_url)
values ('Байланысты әлемдер',
        'Екі параллель әлем бір тағдырмен байланысты. Біреуі кенеттен қайтыс болған эпидемиядан зардап шегеді, екіншісі тиранның мейіріміне бөленді. Бір әлемде Син есімді жігіт которидің балалық шақтағы досына ғашық, ал екіншісінде олар жау: ол Джин бүлікшісі, ал ол Котоконың деспоттық ханшайымы. Джин бір әлемдегі адамның өлімі оның доппелгангерінің өлімін де білдіретінін біледі, сондықтан Коториді өлтіру үшін біздің әлемге көшеді. Бірақ Ұлы басқа адамдардың қақтығыстары үшін махаббатын құрбан етуге дайын емес.',
        2019,
        'Юхэй Сакураги',
        0,
        false,
        'https://www.youtube.com/watch?v=Y14MaJCKAoI&pp=ygUb0KHQstGP0LfQsNC90L3Ri9C1INC80LjRgNGL'),
      ('«Айдар» мультхикаясы (2018 ж.) 1-бөлім ',
        'Қасиетті тұмарды тауып алған Айдар атты кейіпкерімізге құпия міндет жүктеледі. Оның міндеті мифтік әлемде қалған бабалардың қаруын тауып, жеңілмес күшке ие болып, нағыз қаҺарманға айналу. Зұлымдық әміршісі Еркілікпен шайқасып, бабалар аманатын орындау',
        2018,
        'Дильшат Рахматуллин',
        0,
        false,
        'https://youtu.be/ZIN8iq9x19g?si=_z0nDSbguE_s7jo6'),
       ('Мая есімді ара мен Бал Кубогы',
        'Еңбекқор ара Майя туралы мультфильм Вальдемар Бонзельс кітабының желісінде түсірілген мультфильм. Жаз бойы Майяның омартасы қанат талмай еңбектенді. Алайда жинаған балдың жартысын патшайымға беру керек екен. Бұл бұйрықтан құтылудың жалғыз амалы – «Бал ойыны» сайысында жеңіске жету.',
        2018,
        'Ноэль Клири',
        0,
        false,
        'https://www.youtube.com/watch?v=vkSDNafXqoQ&pp=ygUs0J_Rh9GR0LvQutCwINCc0LDQudGPINC4INCa0YPQsdC-0Log0LzRkdC00LA%3D'),
       ('Пошташы Пэт',
        'Әлемді құтқару үшін қанша пошташы қажет? Егер ол кез-келген приключенияға дайын қызық мысықпен жұптасса, біреуі жеткілікті.',
        2014,
        'Майкл Д’Иса-Хоган',
        0,
        false,
        'https://www.youtube.com/watch?v=M3og-lKyOLQ&list=PLsl4cYgzdzj_j7eyyHYK8oy16OibRb7pW'
),
       ('Ойыншықтар Хикаясы 3',
        'Энди шамамен 18 жаста, колледжге жіберілгенге дейін 3 күн қалды, ал оның ойыншықтары, соның ішінде Вуди мен Базз Лайтер, олардың болашағы туралы болжам жасайды.

Олардың тағдыры қайда кетеді? Шатырға, полигонға немесе мүмкін "күн"балабақшасына?

Оқиғалар күтпеген бағытта дамиды және сүйікті кейіпкерлердің шытырман оқиғалары жалғасуда!',
        2010,
        'Ли Анкрич',
        0,
        false,
        'https://youtu.be/EmsZ9vcoKAo?si=nTn5_tKuN9gXjXWK'
),
       ('Ойыншықтар Хикаясы 1',
        'Сюжет Энди есімді балаға тиесілі ойыншықтардың шытырман оқиғаларына арналған. Ұзақ уақыт бойы баланың сүйіктісі ковбой Вуди болды, оның келесі туған күніне дейін Энди ерекше сыйлық - электронды астроранжер Buzz Lightyear алды. Вуди көп ұзамай Эндидің жаңа ойыншыққа есінен танып қалғанын және баланың Баззды өзімен бірге алып кетпеуін қалайтынын түсіне бастайды. Осылайша, сәтті пайдаланып, бұрынғы сүйіктісі танымал жаңадан келгенді терезеден лақтырып жібереді. Кінәлі сезінген ковбой Эндидің отбасы жаңа үйіне көшкенше астронавтты үйіне әкелуді ұйғарады',
        1995,
        'Джон Лассетер',
        0,
        false,
        'https://www.youtube.com/watch?v=LI_GT4uFd-o&pp=ygU00L7QudGL0L3RiNGL0pvRgtCw0YAg0YXQuNC60LDRj9GB0YsgMyDQutCw0LfQsNC60YjQsA%3D%3D'
),
       ('Ойыншықтар Хикаясы 2',
        'Ковбой Вуди және қалған ойыншықтар Эндидің бөлмесінде тұруды жалғастырады. Коллекционер Аль Вудиді экспонат жасау үшін ұрлап кеткенде бәрі өзгереді. Оған 1950 жылдардағы телешоу ойыншықтар жиынтығын аяқтау үшін бар болғаны ковбой ғана қажет - содан кейін Аль коллекцияны жапондық ойыншықтар мұражайына сата алады. Вуди өзінің құнды және коллекциялық деп санайтынына қуанады, сонымен қатар өзінің «байланысты» ойыншықтарымен танысады. Олар ковбойды мұражайдағы өмірдің Эндидің өсіп, одан асып кетуін күткеннен гөрі жақсырақ екеніне сендіреді. Осы уақытта Buzz Light Вудиді үйіне қайтару үшін құтқару операциясын ұйымдастырады.',
        1999,
        'Джон Лассетер',
        0,
        false,
        'https://www.youtube.com/watch?v=gcawsj1M1b0&pp=ygU00L7QudGL0L3RiNGL0pvRgtCw0YAg0YXQuNC60LDRj9GB0YsgMiDQutCw0LfQsNC60YjQsA%3D%3D'
),
       ('Три кота Серия 1',
        'В дружной кошачьей семье постоянно происходят поучительные и забавные события, героями которых становятся котята Карамелька, Компот и Коржик. С любыми трудностями им всегда помогают справиться родители —папа, глава семейства, трудящийся на кондитерской фабрике, и мама, хранительница домашнего уюта и по совместительству талантливый дизайнер детской одежды.
Главные герои имеют свой неповторимый характер и отличительные черты. Семилетний Компот очень развит и эрудирован, все свободное время проводит с книгой и обожает разгадывать головоломки, периодически прерываясь на игры в шахматы с папой. Шестилетний Коржик — кот-батарейка, всегда озорной и с неограниченным запасом энергии, не представляет своей жизни без игр в футбол, бадминтон, догонялок и любой активности, а разговаривает всегда очень громко, шумно. Четырехлетняя Карамелька спокойна и рассудительна, мудра не по годам. Посмотрев онлайн сериал «Три Кота», ваш ребенок сможет познакомиться с героями поближе и узнать в них как себя, так и своих друзей, будет постепенно учиться общаться и взаимодействовать как со сверстниками, так и со взрослыми.',
        2015,
        'Дмитрий Высоцкий',
        0,
        false,
        'https://www.youtube.com/watch?v=bgxiTkAlQrw&ab_channel=iVideos'
),
       ('Три кота Серия 2',
        'В дружной кошачьей семье постоянно происходят поучительные и забавные события, героями которых становятся котята Карамелька, Компот и Коржик. С любыми трудностями им всегда помогают справиться родители —папа, глава семейства, трудящийся на кондитерской фабрике, и мама, хранительница домашнего уюта и по совместительству талантливый дизайнер детской одежды.
Главные герои имеют свой неповторимый характер и отличительные черты. Семилетний Компот очень развит и эрудирован, все свободное время проводит с книгой и обожает разгадывать головоломки, периодически прерываясь на игры в шахматы с папой. Шестилетний Коржик — кот-батарейка, всегда озорной и с неограниченным запасом энергии, не представляет своей жизни без игр в футбол, бадминтон, догонялок и любой активности, а разговаривает всегда очень громко, шумно. Четырехлетняя Карамелька спокойна и рассудительна, мудра не по годам. Посмотрев онлайн сериал «Три Кота», ваш ребенок сможет познакомиться с героями поближе и узнать в них как себя, так и своих друзей, будет постепенно учиться общаться и взаимодействовать как со сверстниками, так и со взрослыми.',
        2015,
        'Дмитрий Высоцкий',
        0,
        false,
        'https://www.youtube.com/watch?v=bgxiTkAlQrw&ab_channel=iVideos'
),
        ('Три кота Серия 3',
        'В дружной кошачьей семье постоянно происходят поучительные и забавные события, героями которых становятся котята Карамелька, Компот и Коржик. С любыми трудностями им всегда помогают справиться родители —папа, глава семейства, трудящийся на кондитерской фабрике, и мама, хранительница домашнего уюта и по совместительству талантливый дизайнер детской одежды.
Главные герои имеют свой неповторимый характер и отличительные черты. Семилетний Компот очень развит и эрудирован, все свободное время проводит с книгой и обожает разгадывать головоломки, периодически прерываясь на игры в шахматы с папой. Шестилетний Коржик — кот-батарейка, всегда озорной и с неограниченным запасом энергии, не представляет своей жизни без игр в футбол, бадминтон, догонялок и любой активности, а разговаривает всегда очень громко, шумно. Четырехлетняя Карамелька спокойна и рассудительна, мудра не по годам. Посмотрев онлайн сериал «Три Кота», ваш ребенок сможет познакомиться с героями поближе и узнать в них как себя, так и своих друзей, будет постепенно учиться общаться и взаимодействовать как со сверстниками, так и со взрослыми.',
        2015,
        'Дмитрий Высоцкий',
        0,
        false,
        'https://www.youtube.com/watch?v=bgxiTkAlQrw&ab_channel=iVideos'
);


create table genres
	(
	  id serial primary key,
	  title text
	)


insert into genres(title)
values ('Комедиялар'),
       ('Отбасымен көретіндер'),
       ('Ғылыми-танымдық'),
       ('Ойын-сауық'),
       ('Ғылыми фантастика және фэнтези'),
       ('Шытырман оқиғалы'),
       ('Қысқаметрлі'),
       ('Музыкалық'),
       ('Спорттық'),
       ('Аниме'),
       ('Мультфильм'),
       ('Боевик');

create table movies_genres
(
    movie_id int references movies(id),
    genre_id int references genres(id)
);

insert into movies_genres(movie_id, genre_id)
values (1, 1),
       (1, 2),
       (2, 1),
       (2, 3),
       (2, 4),
       (3, 1),
       (4, 1),
       (4, 5),
       (4, 6),
       (5, 7),
       (5, 1),
       (5, 6),
       (6, 7),
       (6, 8),
       (6, 1),
       (7, 1),
       (7, 2),
       (7, 9),
       (8, 8),
       (8, 2),
       (8, 5),
       (9, 5),
       (9, 4),
       (9, 1),
       (10, 1);
 
 
create table categories
	(
	  id serial primary key,
	  title text
	) 
	
insert into categories(title)
values ('Мультсериал'),
       ('Мультфильм');
	
	
 
create table movies_categories
(
    movie_id int references movies(id),
    categorie_id int references categories(id)
); 


insert into movies_categories(movie_id, categorie_id)
values (1, 2),
       (2, 2),
       (3, 2),
       (4, 2),
       (5, 1),
       (6, 1),
       (7, 1),
       (8, 1),
       (9, 1),
       (10,1);
       
select
m.*,
g.*
from movies m
join movies_genres mg on mg.movie_id =m.id
join genres g on mg.genre_id = g.id



select
m.*,
c.*
from movies m
join movies_categories mc on mc.movie_id =m.id
join categories c on mc.categorie_id = c.id




create table ages
	(
	  id serial primary key,
	  age text
	)
	
insert into ages(age)
values ('8-10'),
       ('10-12'),
       ('12-14'),
       ('14-16'),
       ('16-18');


create table movies_ages
(
    movie_id int references movies(id),
    age_id int references ages(id)
); 


select
m.*,
a.*
from movies m
join movies_ages ma on ma.movie_id =m.id
join ages a on ma.age_id = a.id


insert into movies_ages(movie_id, age_id)
values (1, 1),
       (1, 5),
       (2, 2),
       (3, 1),
       (4, 3),
       (5, 1),
       (5, 2),
       (6, 4),
       (7, 2),
       (8, 5),
       (9, 2),
       (10,2),
       (10,3);
       
       
create table roles
	(
	  id serial primary key,
	  names text,
	  actors text
	)
	
	
create table movies_roles
(
    movie_id int references movies(id),
    role_id int references roles(id)
); 

insert into roles(names_of_hero, names_of_actors)
values  ('Майя', 'Коко Джек Гиллис'),  ---пчелка  1
        ('Кларк Король', 'Джастин'),   ---пчелка  2
        ('Генчи', 'Ноэль Клири'),      ---пчелка  3
        ('Румба', 'Фрэнсис Берри'),    ---пчелка  4
        ('Shin Hazama', 'Андрей Мишутин'),    ---миры  5
        ('Kotori Izumi', 'Ева Финкельштейн'), ---миры  6
        ('Jin', 'Андрей Мишутин'),            ---миры  7 
        ('Aoi Yuki ', 'Татьяна Абрамова'),    ---миры  8
        ('Почтальон Пэт', 'Стивен Мэнгэн'),   ---пэт 9
        ('мистер Браун', 'Джим Бродбент'),    ---пэт 10
        ('Джош', 'Руперт Гринт'),             ---пэт 11
        ('Тед Гленн', 'Дэн Хильдебранд'),     ---пэт 12
        ('игрушка-ковбой шериф Вуди', 'Том Хэнкс'),          ---игрушки 1 13
        ('игрушка-астрорейнджер Базз Лайтер', 'Тим Аллен'),  ---игрушки 1 14
        ('игрушка мистер Картофельная Голова', 'Дон Риклс'), ---игрушки 1 15 
        ('такса-пружина Спиралька', 'Джим Варни'),           ---игрушки 1 16
        ('Папа, Телеведущий, Дядя Кекс, Начальник вокзала, Комментатор, Спортсмен, Официант, Кекс, Папин брат, Сотрудник ', 'Михаил Хрусталёв'),  ---три кота 17
        ('Компот', 'Михаил Новодворцев'),  ---три кота 18
        ('Коржик', 'Илья Хрусталёв'),  ---три кота 19
        ('Карамелька', 'Александра Глушинская');  ---три кота 20
        
insert into movies_roles(movie_id, role_id)
values (1, 1),   ---пчелка            
       (1, 2),	 ---пчелка
       (1, 3),   ---пчелка
       (1, 4),   ---пчелка
       (2, 5),   ---миры
       (2, 6),   ---миры
       (2, 7),   ---миры
       (2, 8),   ---миры
       (4, 9),   ---пэт
       (4, 10),  ---пэт
       (4, 11),  ---пэт
       (4, 12),  ---пэт
       (5, 13),  --- игрушки 1
       (5, 14),  --- игрушки 1
       (5, 15),  --- игрушки 1
       (5, 16),  --- игрушки 1
       (6, 13),  --- игрушки 2
       (6, 14), --- игрушки 2
       (6, 15), --- игрушки 2
       (6, 16), --- игрушки 2
       (7, 13),  --- игрушки 3
       (7, 14),  --- игрушки 3
       (7, 15),  --- игрушки 3
       (7, 16),  --- игрушки 3
       (8, 17),   ---три кота 1
       (8, 18),   ---три кота 1
       (8, 19),   ---три кота 1
       (8, 20),   ---три кота 1
       (9, 17),   ---три кота 2
       (9, 18),   ---три кота 2
       (9, 19),   ---три кота 2
       (9, 20),   ---три кота 2
       (10, 17),   ---три кота 3
       (10, 18),   ---три кота 3
       (10, 19),   ---три кота 3
       (10, 20);   ---три кота 3
       
select
m.*,
r.*
from movies m
join movies_roles mr on mr.movie_id =m.id
join roles r on mr.role_id = r.id


	
	
